<?php
//Содержит массив для настройки опциональных полей подстраницы админпанели "Параметры темы"
function add_theme_option_fields() {
    global $options_page;
    
    $args = [
        ['theme_section_1', 'Назва для блоку контактів на сайті', 'company_footer_fields_title', '',
            'По замовчуванню - Контакти', 'input',  'Введіть назву блоку контактів'],
        
        ['theme_section_1', 'Номер телефону 1 для блоку контактів на сайті', 'company_footer_phone1', 30,
            'Приклад +38 123 45 67', 'input', 'Введіть номер телефону'],
        
        ['theme_section_1', 'Номер телефону 2 для блоку контактів на сайті', 'company_footer_phone2', 30,
            'Приклад +38 123 45 67', 'input', 'Введіть номер телефону'],

        ['theme_section_1', 'Номер телефону 3 для блоку контактів на сайті', 'company_footer_phone3', 30,
            'Приклад +38 123 45 67', 'input', 'Введіть номер телефону'],

        ['theme_section_1', 'Поштовий індекс, країна, місто', 'company_country_town', '',
            'Приклад 76000, Україна, Івано-Франківськ', 'input', 'Введіть номер індексу, назву країни, назву міста'],

        ['theme_section_1', 'Вулиця, номер будинку', 'company_street', '',
            'Приклад вул. Дністровська 49', 'input', 'Введіть назву вулиці і номер будинку'],

        ['theme_section_2', 'Понеділок', 'company_schedule_monday_start', '', 'від', 'time', ''],
        
        ['theme_section_2', '', 'company_schedule_monday_finish', '', 'до', 'time', ''],
        
        ['theme_section_2', 'Вівторок', 'company_schedule_tuesday_start', '', 'від', 'time', ''],
        
        ['theme_section_2', '', 'company_schedule_tuesday_finish', '', 'до', 'time', ''],

        ['theme_section_2', 'Середа', 'company_schedule_wednesday_start', '', 'від', 'time', ''],

        ['theme_section_2', '', 'company_schedule_wednesday_finish', '', 'до', 'time', ''],

        ['theme_section_2', 'Четвер', 'company_schedule_thursday_start', '', 'від', 'time', ''],

        ['theme_section_2', '', 'company_schedule_thursday_finish', '', 'до', 'time', ''],

        ['theme_section_2', 'Пятниця', 'company_schedule_friday_start', '', 'від', 'time', ''],

        ['theme_section_2', '', 'company_schedule_friday_finish', '', 'до', 'time', ''],

        ['theme_section_2', 'Субота', 'company_schedule_saturday_start', '', 'від', 'time', ''],

        ['theme_section_2', '', 'company_schedule_saturday_finish', '', 'до', 'time', ''],

        ['theme_section_2', 'Неділя', 'company_schedule_sunday_start', '', 'від', 'time', ''],

        ['theme_section_2', '', 'company_schedule_sunday_finish', '', 'до', 'time', ''],

         ['theme_section_3', 'Текст кнопки стрічки над блоком контактів', 'tape_btn_text', 30,
            'По замовчуванню - Пожертвувати', 'input', 'Введіть текст кнопки на стрічці над блоком контактів (не більше 30 символів)'],

        ['theme_section_3', 'Гіперпосилання для кнопки на стрічці над блоком контактів', 'tape_btn_link', '',
            '', 'url', 'Введіть посилання на зовнішній ресурс або сторінку сайту'],

        ['theme_section_3', 'Текст кнопки допомоги на сторінці публікації', 'article_btn_text', 30,
            'По замовчуванню - Допомогти', 'input', 'Введіть текст кнопки допомоги на сторінці публікації (не більше 30 символів)'],

        ['theme_section_3', 'Гіперпосилання для кнопки допомоги на сторінці публікації', 'article_btn_link', '',
            '', 'url', 'Введіть посилання на зовнішній ресурс або сторінку сайту'],

        ['theme_section_3', 'Текст кнопки завантажень на сторінці звітів', 'reports_btn_text', 30,
            'По замовчуванню - Завантажити', 'input', 'Введіть текст кнопки завантажень на сторінці звітів (не більше 30 символів)'],

        ['theme_section_3', 'Текст кнопки завантажень на сторінці русурсів', 'resourses_btn_text', 30,
            'По замовчуванню - Перейти', 'input', 'Введіть текст кнопки завантажень на сторінці русурсів (не більше 30 символів)'],

        ['theme_section_4', 'Текст кнопки допомоги на загальній сторінці проектів', 'all_projects_btn_text', 30,
            'По замовчуванню - Хочу допомогти', 'input', 'Введіть текст кнопки на стрічці над блоком контактів (не більше 30 символів)'],

        ['theme_section_4', 'Гіперпосилання для кнопки допомоги на загальній сторінці проектів', 'all_projects_btn_link', '',
            '', 'url', 'Введіть посилання на зовнішній ресурс або сторінку сайту'],

        ['theme_section_4', 'Назва для таба 1 на сторінці окремого проекту', 'projects_tab1_text', 20,
            'По замовчуванню - Донори', 'input', 'Введіть текст (не більше 20 символів)'],

        ['theme_section_4', 'Назва для таба 2 на сторінці окремого проекту', 'projects_tab2_text', 20,
            'По замовчуванню - Блог', 'input', 'Введіть текст (не більше 20 символів)'],

        ['theme_section_4', 'Назва для таба 3 на сторінці окремого проекту', 'projects_tab3_text', 20,
            'По замовчуванню - Документи', 'input', 'Введіть текст (не більше 20 символів)'],

        ['theme_section_4', 'Назва кнопки для перегляду документа на сторінці окремого проекту', 'projects_view_doc_text', 20,
            'По замовчуванню - Переглянути', 'input', 'Введіть текст (не більше 20 символів)'],

        ['theme_section_4', 'Назва поля1 секції з виводом коштів на сторінці окремого проекту', 'projects_field1_text', 30,
            'По замовчуванню - Потрібно зібрати', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_4', 'Назва поля2 секції з виводом коштів на сторінці окремого проекту', 'projects_field2_text', 30,
            'По замовчуванню - Зібрано', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_4', 'Назва поля3 секції з виводом коштів на сторінці окремого проекту', 'projects_field3_text', 30,
            'По замовчуванню - Залишилось', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_4', 'Назва грошової одиниці', 'projects_money_name', 10,
            'По замовчуванню - грн', 'input', 'Введіть текст (не більше 10 символів)'],

        ['theme_section_4', 'Назва поля адмінпанелі з сумою коштів, які потрібно зібрати', 'projects_admin_money_sum', 30,
            'По замовчуванню - Потрібно зібрати', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_4', 'Назва поля адмінпанелі з наймунуванням волонтера', 'projects_admin_volonter', 30,
            'По замовчуванню - Ім`я волонтера', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_4', 'Назва поля адмінпанелі для відображення суми допомогои волонтера', 'projects_admin_money_in', 30,
            'По замовчуванню - Допомога', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_4', 'Назва поля адмінпанелі для найменування документа', 'projects_admin_doc_name', 30,
            'По замовчуванню - Назва документа', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_4', 'Назва поля адмінпанелі для посилання на файл документа', 'projects_admin_doc_file', 30,
            'По замовчуванню - Посилання на документ', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_4', 'Текст помилки на сторінці при відсутності записів', 'projects_empty_posts', 30,
            'По замовчуванню - Немає постів', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_4', 'Текст помилки на сторінці при відсутності донатів', 'projects_empty_donors', 30,
            'По замовчуванню - Немає донатів', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_4', 'Текст помилки на сторінці при відсутності документів', 'projects_empty_docs', 30,
            'По замовчуванню - Немає документів', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_4', 'Текст помилки на сторінці при відсутності статей', 'projects_empty_articles', 30,
            'По замовчуванню - Немає статей', 'input', 'Введіть текст (не більше 30 символів)'],

        ['theme_section_5', 'Назва для блоку "Дивіться також"', 'field_see_also', 30,
            'По замовчуванню - Дивіться також', 'input', 'Введіть назву блоку відображення на сторінці інших записів (не більше 40 символів)'],

        ['theme_section_5', 'Текст стрічки над блоком контактів', 'field_top_contacts', 40,
            'По замовчуванню - Допомогти так легко', 'input', 'Введите текст, який відображається на стрічці над блоком контактів (не більше 40 символів)'],

        ['theme_section_5', 'Логотип сайту', 'site_logo', '', '', 'img-main-page', ''],

    ];

    foreach ($args as $field) {
        make_theme_option_field($field[0], $field[1], $field[2], $field[3], $field[4], $field[5], $field[6],  $options_page);
    }
}

add_action('admin_init', 'add_theme_option_fields');

get_template_part( '/back/theme_options/make_field');
get_template_part( '/back/theme_options/render_settings');
?>